STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251cxx_cm33.h
  __IO uint32_t MACSTNUR;                             /*!< System time nanoseconds update register                    Address offset: 0x0B14 */
  __IO uint32_t MACTSAR;                              /*!< Timestamp addend register                                  Address offset: 0x0B18 */
       uint32_t RESERVED27;                           /*!< Reserved                                                   Address offset: 0x0B1C */
  __IO uint32_t MACTSSR;                              /*!< Timestamp status register                                  Address offset: 0x0B20 */
  __IO uint32_t MACRXDTI;                             /*!< Rx domain time increment register                          Address offset: 0x0B24 */
  __IO uint32_t MACTXDTI;                             /*!< Tx domain time increment register                          Address offset: 0x0B28 */
       uint32_t RESERVED28;                           /*!< Reserved                                                   Address offset: 0x0B2C */
  __IO uint32_t MACTXTSSNR;                           /*!< Tx timestamp status nanoseconds register                   Address offset: 0x0B30 */
  __IO uint32_t MACTXTSSSR;                           /*!< Tx timestamp status seconds register                       Address offset: 0x0B34 */
       uint32_t RESERVED29[2];                        /*!< Reserved                                                   Address offset: 0x0B38-0x0B3C */
  __IO uint32_t MACACR;                               /*!< Auxiliary control register                                 Address offset: 0x0B40 */
       uint32_t RESERVED30;                           /*!< Reserved                                                   Address offset: 0x0B44 */
  __IO uint32_t MACATSNR;                             /*!< Auxiliary timestamp nanoseconds register                   Address offset: 0x0B48 */
  __IO uint32_t MACATSSR;                             /*!< Auxiliary timestamp seconds register                       Address offset: 0x0B4C */
  __IO uint32_t MACTSIACR;                            /*!< Timestamp ingress asymmetric correction register           Address offset: 0x0B50 */
  __IO uint32_t MACTSEACR;                            /*!< Timestamp egress asymmetric correction register            Address offset: 0x0B54 */
  __IO uint32_t MACTSICNR;                            /*!< Timestamp Ingress correction nanosecond register           Address offset: 0x0B58 */
  __IO uint32_t MACTSECNR;                            /*!< Timestamp egress correction nanosecond register            Address offset: 0x0B5C */
       uint32_t RESERVED31[2];                        /*!< Reserved                                                   Address offset: 0x0B60-0x0B64 */
  __IO uint32_t MACTSILR;                             /*!< Timestamp Ingress Latency register                         Address offset: 0x0B68 */
  __IO uint32_t MACTSELR;                             /*!< Timestamp Egress Latency register                          Address offset: 0x0B6C */
  __IO uint32_t MACPPSCR;                             /*!< PPS control register                                       Address offset: 0x0B70 */
       uint32_t RESERVED32[3];                        /*!< Reserved                                                   Address offset: 0x0B74-0x0B7C */
  __IO uint32_t MACPPSTTS0R;                          /*!< PPS 0 target time seconds register                         Address offset: 0x0B80 */
  __IO uint32_t MACPPSTTN0R;                          /*!< PPS 0 target time nanoseconds register                     Address offset: 0x0B84 */
  __IO uint32_t MACPPSI0R;                            /*!< PPS 0 interval register                                    Address offset: 0x0B88 */
  __IO uint32_t MACPPSW0R;                            /*!< PPS 0 width register                                       Address offset: 0x0B8C */
  __IO uint32_t MACPPSTTS1R;                          /*!< PPS 1 target time seconds register                         Address offset: 0x0B90 */
  __IO uint32_t MACPPSTTN1R;                          /*!< PPS 1 target time nanoseconds register                     Address offset: 0x0B94 */
  __IO uint32_t MACPPSI1R;                            /*!< PPS 1 interval register                                    Address offset: 0x0B98 */
  __IO uint32_t MACPPSW1R;                            /*!< PPS 1 width register                                       Address offset: 0x0B9C */
       uint32_t RESERVED33[8];                        /*!< Reserved                                                   Address offset: 0x0BA0-0x0BBC */
  __IO uint32_t MACPOCR;                              /*!< PTP Offload control register                               Address offset: 0x0BC0 */
  __IO uint32_t MACSPI0R;                             /*!< PTP Source Port Identity 0 Register                        Address offset: 0x0BC4 */
  __IO uint32_t MACSPI1R;                             /*!< PTP Source port identity 1 register                        Address offset: 0x0BC8 */
  __IO uint32_t MACSPI2R;                             /*!< PTP Source port identity 2 register                        Address offset: 0x0BCC */
  __IO uint32_t MACLMIR;                              /*!< Log message interval register                              Address offset: 0x0BD0 */
       uint32_t RESERVED34[11];                       /*!< Reserved                                                   Address offset: 0x0BD4-0x0BFC */
  __IO uint32_t MTLOMR;                               /*!< Operating mode register                                    Address offset: 0x0C00 */
       uint32_t RESERVED35[7];                        /*!< Reserved                                                   Address offset: 0x0C04-0x0C1C */
  __IO uint32_t MTLISR;                               /*!< Interrupt status register                                  Address offset: 0x0C20 */
       uint32_t RESERVED36[3];                        /*!< Reserved                                                   Address offset: 0x0C24-0x0C2C */
  __IO uint32_t MTLRXQDMAMR;                          /*!< Rx Queue and DMA Channel Mapping register                  Address offset: 0x0C30 */
       uint32_t RESERVED37[3];                        /*!< Reserved                                                   Address offset: 0x0C34-0x0C3C */
  __IO uint32_t MTLTBSCR;                             /*!< TBS control register                                       Address offset: 0x0C40 */
       uint32_t RESERVED38[3];                        /*!< Reserved                                                   Address offset: 0x0C44-0x0C4C */
  __IO uint32_t MTLESTCR;                             /*!< EST Control register                                       Address offset: 0x0C50 */
  __IO uint32_t MTLESTECR;                            /*!< EST Extended Control register                              Address offset: 0x0C54 */
  __IO uint32_t MTLESTSR;                             /*!< EST Status register                                        Address offset: 0x0C58 */
       uint32_t RESERVED39;                           /*!< Reserved                                                   Address offset: 0x0C5C */
  __IO uint32_t MTLESTSCHER;                          /*!< EST Schedule Error register                                Address offset: 0x0C60 */
  __IO uint32_t MTLESTFSER;                           /*!< EST Frame size Error register                              Address offset: 0x0C64 */
  __IO uint32_t MTLESTFSCR;                           /*!< EST Frame size Capture register                            Address offset: 0x0C68 */
       uint32_t RESERVED40;                           /*!< Reserved                                                   Address offset: 0x0C6C */
  __IO uint32_t MTLESTIER;                            /*!< EST Interrupt Enable register                              Address offset: 0x0C70 */
       uint32_t RESERVED41[3];                        /*!< Reserved                                                   Address offset: 0x0C74-0x0C7C */
  __IO uint32_t MTLESTGCLCR;                          /*!< EST Gate Control List register                             Address offset: 0x0C80 */
  __IO uint32_t MTLESTGCLDR;                          /*!< EST Gate Control List Data register                        Address offset: 0x0C84 */
       uint32_t RESERVED42[2];                        /*!< Reserved                                                   Address offset: 0x0C88-0x0C8C */
  __IO uint32_t MTLFPECSR;                            /*!< FPE Frame Preemption Control Status register               Address offset: 0x0C90 */
  __IO uint32_t MTLFPEAR;                             /*!< FPE Frame Preemption Advance register                      Address offset: 0x0C94 */
       uint32_t RESERVED43[26];                       /*!< Reserved                                                   Address offset: 0x0C98-0x0CFC */
  __IO uint32_t MTLTXQ0OMR;                           /*!< T0 queue 0 operating mode register                         Address offset: 0x0D00 */
  __IO uint32_t MTLTXQ0UR;                            /*!< T0 queue 0 underflow register                              Address offset: 0x0D04 */
  __IO uint32_t MTLTXQ0DR;                            /*!< T0 queue 0 debug register                                  Address offset: 0x0D08 */
       uint32_t RESERVED44[2];                        /*!< Reserved                                                   Address offset: 0x0D0C-0x0D10 */
  __IO uint32_t MTLTXQ0ESR;                           /*!< T0 queue 0 ETS status register                             Address offset: 0x0D14 */
  __IO uint32_t MTLTXQ0QWR;                           /*!< T0 queue 0 quantum weight register                         Address offset: 0x0D18 */
       uint32_t RESERVED45[4];                        /*!< Reserved                                                   Address offset: 0x0D1C-0x0D28 */
  __IO uint32_t MTLQ0ICSR;                            /*!< Queue 0 interrupt control status register                  Address offset: 0x0D2C */
  __IO uint32_t MTLRXQ0OMR;                           /*!< R0 queue 0 operating mode register                         Address offset: 0x0D30 */
  __IO uint32_t MTLRXQ0MPOCR;                         /*!< R0 queue 0 missed packet and overflow counter register     Address offset: 0x0D34 */
  __IO uint32_t MTLRXQ0DR;                            /*!< R0 queue 0 debug register                                  Address offset: 0x0D38 */
  __IO uint32_t MTLRXQ0CR;                            /*!< R0 queue 0 control register                                Address offset: 0x0D3C */
  __IO uint32_t MTLTXQ1OMR;                           /*!< T1 queue 1 operating mode register                         Address offset: 0x0D40 */
  __IO uint32_t MTLTXQ1UR;                            /*!< T1 queue 1 underflow register                              Address offset: 0x0D44 */
  __IO uint32_t MTLTXQ1DR;                            /*!< T1 queue 1 debug register                                  Address offset: 0x0D48 */
       uint32_t RESERVED46;                           /*!< Reserved                                                   Address offset: 0x0D4C */
  __IO uint32_t MTLTXQ1ECR;                           /*!< T1 queue 1 ETS control register                            Address offset: 0x0D50 */
  __IO uint32_t MTLTXQ1ESR;                           /*!< T1 queue 1 ETS status register                             Address offset: 0x0D54 */
  __IO uint32_t MTLTXQ1QWR;                           /*!< T1 queue 1 quantum weight register                         Address offset: 0x0D58 */
  __IO uint32_t MTLTXQ1SSCR;                          /*!< T1 queue 1 send slope credit register                      Address offset: 0x0D5C */
  __IO uint32_t MTLTXQ1HCR;                           /*!< T1 Queue 1 hiCredit register                               Address offset: 0x0D60 */
  __IO uint32_t MTLTXQ1LCR;                           /*!< T1 queue 1 loCredit register                               Address offset: 0x0D64 */
       uint32_t RESERVED47;                           /*!< Reserved                                                   Address offset: 0x0D68 */
  __IO uint32_t MTLQ1ICSR;                            /*!< Queue 1 interrupt control status register                  Address offset: 0x0D6C */
  __IO uint32_t MTLRXQ1OMR;                           /*!< R1 queue 1 operating mode register                         Address offset: 0x0D70 */
  __IO uint32_t MTLRXQ1MPOCR;                         /*!< R1 queue 1 missed packet and overflow counter register     Address offset: 0x0D74 */
  __IO uint32_t MTLRXQ1DR;                            /*!< R1 queue 1 debug register                                  Address offset: 0x0D78 */
  __IO uint32_t MTLRXQ1CR;                            /*!< R1 queue 1 control register                                Address offset: 0x0D7C */
  __IO uint32_t MTLTXQ2OMR;                           /*!< T2 queue 2 operating mode register                         Address offset: 0x0D80 */
  __IO uint32_t MTLTXQ2UR;                            /*!< T2 queue 2 underflow register                              Address offset: 0x0D84 */
  __IO uint32_t MTLTXQ2DR;                            /*!< T2 queue 2 debug register                                  Address offset: 0x0D88 */
       uint32_t RESERVED48;                           /*!< Reserved                                                   Address offset: 0x0D8C */
  __IO uint32_t MTLTXQ2ECR;                           /*!< T2 queue 2 ETS control register                            Address offset: 0x0D90 */
  __IO uint32_t MTLTXQ2ESR;                           /*!< T2 queue 2 ETS status register                             Address offset: 0x0D94 */
  __IO uint32_t MTLTXQ2QWR;                           /*!< T2 queue 2 quantum weight register                         Address offset: 0x0D98 */
  __IO uint32_t MTLTXQ2SSCR;                          /*!< T2 queue 2 send slope credit register                      Address offset: 0x0D9C */
  __IO uint32_t MTLTXQ2HCR;                           /*!< T2 Queue 2 hiCredit register                               Address offset: 0x0DA0 */
  __IO uint32_t MTLTXQ2LCR;                           /*!< T2 queue 2 loCredit register                               Address offset: 0x0DA4 */
       uint32_t RESERVED49;                           /*!< Reserved                                                   Address offset: 0x0DA8 */
  __IO uint32_t MTLQ2ICSR;                            /*!< Queue 2 interrupt control status register                  Address offset: 0x0DAC */
       uint32_t RESERVED50[4];                        /*!< Reserved                                                   Address offset: 0x0DB0-0x0DBC */
  __IO uint32_t MTLTXQ3OMR;                           /*!< T3 queue 3 operating mode register                         Address offset: 0x0DC0 */
  __IO uint32_t MTLTXQ3UR;                            /*!< T3 queue 3 underflow register                              Address offset: 0x0DC4 */
  __IO uint32_t MTLTXQ3DR;                            /*!< T3 queue 3 debug register                                  Address offset: 0x0DC8 */
       uint32_t RESERVED51;                           /*!< Reserved                                                   Address offset: 0x0DCC */
  __IO uint32_t MTLTXQ3ECR;                           /*!< T3 queue 3 ETS control register                            Address offset: 0x0DD0 */
  __IO uint32_t MTLTXQ3ESR;                           /*!< T3 queue 3 ETS status register                             Address offset: 0x0DD4 */
  __IO uint32_t MTLTXQ3QWR;                           /*!< T3 queue 3 quantum weight register                         Address offset: 0x0DD8 */
  __IO uint32_t MTLTXQ3SSCR;                          /*!< T3 queue 3 send slope credit register                      Address offset: 0x0DDC */
  __IO uint32_t MTLTXQ3HCR;                           /*!< T3 Queue 3 hiCredit register                               Address offset: 0x0DE0 */
  __IO uint32_t MTLTXQ3LCR;                           /*!< T3 queue 3 loCredit register                               Address offset: 0x0DE4 */
       uint32_t RESERVED52;                           /*!< Reserved                                                   Address offset: 0x0DE8 */
  __IO uint32_t MTLQ3ICSR;                            /*!< Queue 3 interrupt control status register                  Address offset: 0x0DEC */
       uint32_t RESERVED53[132];                      /*!< Reserved                                                   Address offset: 0x0DF0-0x0FFC */
  __IO uint32_t DMAMR;                                /*!< DMA mode register                                          Address offset: 0x1000 */
  __IO uint32_t DMASBMR;                              /*!< System bus mode register                                   Address offset: 0x1004 */
  __IO uint32_t DMAISR;                               /*!< Interrupt status register                                  Address offset: 0x1008 */
  __IO uint32_t DMADS1R;                              /*!< Debug status 1 register                                    Address offset: 0x100C */
  __IO uint32_t DMADS2R;                              /*!< Debug status 2 register                                    Address offset: 0x1010 */
       uint32_t RESERVED54[3];                        /*!< Reserved                                                   Address offset: 0x1014-0x101C */
  __IO uint32_t DMAA4TXACR;                           /*!< AXI4 transmit channel ACE control register                 Address offset: 0x1020 */
  __IO uint32_t DMAA4RXACR;                           /*!< AXI4 receive channel ACE control register                  Address offset: 0x1024 */
  __IO uint32_t DMAA4DACR;                            /*!< AXI4 descriptor ACE control register                       Address offset: 0x1028 */
       uint32_t RESERVED55[5];                        /*!< Reserved                                                   Address offset: 0x102C-0x103C */
  __IO uint32_t DMALPIEI;                             /*!< AXI4 LPI Entry Interval register                           Address offset: 0x1040 */
       uint32_t RESERVED56[3];                        /*!< Reserved                                                   Address offset: 0x1044-0x104C */
  __IO uint32_t DMATBSCTRL0R;                         /*!< DMA TBS control register 0                                 Address offset: 0x1050 */
  __IO uint32_t DMATBSCTRL1R;                         /*!< DMA TBS control register 1                                 Address offset: 0x1054 */
  __IO uint32_t DMATBSCTRL2R;                         /*!< DMA TBS control register 2                                 Address offset: 0x1058 */
  __IO uint32_t DMATBSCTRL3R;                         /*!< DMA TBS control register 3                                 Address offset: 0x105C */
       uint32_t RESERVED57[40];                       /*!< Reserved                                                   Address offset: 0x1060-0x10FC */
  __IO uint32_t DMAC0CR;                              /*!< Channel 0 control register                                 Address offset: 0x1100 */
  __IO uint32_t DMAC0TXCR;                            /*!< Channel 0 transmit control register                        Address offset: 0x1104 */
  __IO uint32_t DMAC0RXCR;                            /*!< Channel 0 receive control register                         Address offset: 0x1108 */
       uint32_t RESERVED58[2];                        /*!< Reserved                                                   Address offset: 0x110C-0x1110 */
  __IO uint32_t DMAC0TXDLAR;                          /*!< Channel 0 T0 descriptor list address register              Address offset: 0x1114 */
       uint32_t RESERVED59;                           /*!< Reserved                                                   Address offset: 0x1118 */
  __IO uint32_t DMAC0RXDLAR;                          /*!< Channel 0 R0 descriptor list address register              Address offset: 0x111C */
  __IO uint32_t DMAC0TXDTPR;                          /*!< Channel 0 T0 descriptor tail pointer register              Address offset: 0x1120 */
       uint32_t RESERVED60;                           /*!< Reserved                                                   Address offset: 0x1124 */
  __IO uint32_t DMAC0RXDTPR;                          /*!< Channel 0 R0 descriptor tail pointer register              Address offset: 0x1128 */
  __IO uint32_t DMAC0TXRLR;                           /*!< Channel 0 T0 descriptor ring length register               Address offset: 0x112C */
  __IO uint32_t DMAC0RXRLR;                           /*!< Channel 0 R0 descriptor ring length register               Address offset: 0x1130 */
  __IO uint32_t DMAC0IER;                             /*!< Channel 0 interrupt enable register                        Address offset: 0x1134 */
  __IO uint32_t DMAC0RXIWTR;                          /*!< Channel 0 R0 interrupt watchdog timer register             Address offset: 0x1138 */
  __IO uint32_t DMAC0SFCSR;                           /*!< Channel 0 slot function control status register            Address offset: 0x113C */
       uint32_t RESERVED61;                           /*!< Reserved                                                   Address offset: 0x1140 */
  __IO uint32_t DMAC0CATXDR;                          /*!< Channel 0 current application transmit descriptor register Address offset: 0x1144 */
       uint32_t RESERVED62;                           /*!< Reserved                                                   Address offset: 0x1148 */
  __IO uint32_t DMAC0CARXDR;                          /*!< Channel 0 current application receive descriptor register  Address offset: 0x114C */
       uint32_t RESERVED63;                           /*!< Reserved                                                   Address offset: 0x1150 */
  __IO uint32_t DMAC0CATXBR;                          /*!< Channel 0 current application transmit buffer register     Address offset: 0x1154 */
       uint32_t RESERVED64;                           /*!< Reserved                                                   Address offset: 0x1158 */
  __IO uint32_t DMAC0CARXBR;                          /*!< Channel 0 current application receive buffer register      Address offset: 0x115C */
  __IO uint32_t DMAC0SR;                              /*!< Channel 0 status register                                  Address offset: 0x1160 */
  __IO uint32_t DMAC0MFCR;                            /*!< Channel 0 missed frame count register                      Address offset: 0x1164 */
       uint32_t RESERVED65[6];                        /*!< Reserved                                                   Address offset: 0x1168-0x117C */
  __IO uint32_t DMAC1CR;                              /*!< Channel 1 control register                                 Address offset: 0x1180 */
  __IO uint32_t DMAC1TXCR;                            /*!< Channel 1 transmit control register                        Address offset: 0x1184 */
  __IO uint32_t DMAC1RXCR;                            /*!< Channel 1 receive control register                         Address offset: 0x1188 */
       uint32_t RESERVED66[2];                        /*!< Reserved                                                   Address offset: 0x118C-0x1190 */
  __IO uint32_t DMAC1TXDLAR;                          /*!< Channel 1 T1 descriptor list address register              Address offset: 0x1194 */
       uint32_t RESERVED67;                           /*!< Reserved                                                   Address offset: 0x1198 */
