STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251cxx_cm33.h
#define TIM12                       TIM12_NS
#define TIM12_BASE                  TIM12_BASE_NS

#define TIM13                       TIM13_NS
#define TIM13_BASE                  TIM13_BASE_NS

#define TIM14                       TIM14_NS
#define TIM14_BASE                  TIM14_BASE_NS

#define LPTIM1                      LPTIM1_NS
#define LPTIM1_BASE                 LPTIM1_BASE_NS

#define LPTIM2                      LPTIM2_NS
#define LPTIM2_BASE                 LPTIM2_BASE_NS

#define SPI2                        SPI2_NS
#define SPI2_BASE                   SPI2_BASE_NS

#define SPI3                        SPI3_NS
#define SPI3_BASE                   SPI3_BASE_NS

#define SPDIFRX                     SPDIFRX_NS
#define SPDIFRX_BASE                SPDIFRX_BASE_NS

#define USART2                      USART2_NS
#define USART2_BASE                 USART2_BASE_NS

#define USART3                      USART3_NS
#define USART3_BASE                 USART3_BASE_NS

#define UART4                       UART4_NS
#define UART4_BASE                  UART4_BASE_NS

#define UART5                       UART5_NS
#define UART5_BASE                  UART5_BASE_NS

#define I2C1                        I2C1_NS
#define I2C1_BASE                   I2C1_BASE_NS

#define I2C2                        I2C2_NS
#define I2C2_BASE                   I2C2_BASE_NS

#define I2C3                        I2C3_NS
#define I2C3_BASE                   I2C3_BASE_NS

#define I2C4                        I2C4_NS
#define I2C4_BASE                   I2C4_BASE_NS

#define I2C5                        I2C5_NS
#define I2C5_BASE                   I2C5_BASE_NS

#define I2C6                        I2C6_NS
#define I2C6_BASE                   I2C6_BASE_NS

#define I2C7                        I2C7_NS
#define I2C7_BASE                   I2C7_BASE_NS

#define I3C1                        I3C1_NS
#define I3C1_BASE                   I3C1_BASE_NS

#define I3C2                        I3C2_NS
#define I3C2_BASE                   I3C2_BASE_NS

#define I3C3                        I3C3_NS
#define I3C3_BASE                   I3C3_BASE_NS

#define TIM10                       TIM10_NS
#define TIM10_BASE                  TIM10_BASE_NS

#define TIM11                       TIM11_NS
#define TIM11_BASE                  TIM11_BASE_NS

/*!< APB2 peripherals defaults to Non secure aliases */
#define TIM1                        TIM1_NS
#define TIM1_BASE                   TIM1_BASE_NS

#define TIM8                        TIM8_NS
#define TIM8_BASE                   TIM8_BASE_NS

#define USART6                      USART6_NS
#define USART6_BASE                 USART6_BASE_NS

#define SPI1                        SPI1_NS
#define SPI1_BASE                   SPI1_BASE_NS

#define SPI4                        SPI4_NS
#define SPI4_BASE                   SPI4_BASE_NS

#define TIM15                       TIM15_NS
#define TIM15_BASE                  TIM15_BASE_NS

#define TIM16                       TIM16_NS
#define TIM16_BASE                  TIM16_BASE_NS

#define TIM17                       TIM17_NS
#define TIM17_BASE                  TIM17_BASE_NS

#define SPI5                        SPI5_NS
#define SPI5_BASE                   SPI5_BASE_NS

#define SAI1                        SAI1_NS
#define SAI1_BASE                   SAI1_BASE_NS

#define SAI1_Block_A                SAI1_Block_A_NS
#define SAI1_Block_A_BASE           SAI1_Block_A_BASE_NS

#define SAI1_Block_B                SAI1_Block_B_NS
#define SAI1_Block_B_BASE           SAI1_Block_B_BASE_NS

#define SAI2                        SAI2_NS
#define SAI2_BASE                   SAI2_BASE_NS

#define SAI2_Block_A                SAI2_Block_A_NS
#define SAI2_Block_A_BASE           SAI2_Block_A_BASE_NS

#define SAI2_Block_B                SAI2_Block_B_NS
#define SAI2_Block_B_BASE           SAI2_Block_B_BASE_NS

#define SAI3                        SAI3_NS
#define SAI3_BASE                   SAI3_BASE_NS

#define SAI3_Block_A                SAI3_Block_A_NS
#define SAI3_Block_A_BASE           SAI3_Block_A_BASE_NS

#define SAI3_Block_B                SAI3_Block_B_NS
#define SAI3_Block_B_BASE           SAI3_Block_B_BASE_NS

#define UART9                       UART9_NS
#define UART9_BASE                  UART9_BASE_NS
#define TIM20                       TIM20_NS
#define TIM20_BASE                  TIM20_BASE_NS

#define USART1                      USART1_NS
#define USART1_BASE                 USART1_BASE_NS

#define SAI4                        SAI4_NS
#define SAI4_BASE                   SAI4_BASE_NS

#define SAI4_Block_A                SAI4_Block_A_NS
#define SAI4_Block_A_BASE           SAI4_Block_A_BASE_NS

#define SAI4_Block_B                SAI4_Block_B_NS
#define SAI4_Block_B_BASE           SAI4_Block_B_BASE_NS

#define SPI6                        SPI6_NS
#define SPI6_BASE                   SPI6_BASE_NS

#define SPI7                        SPI7_NS
#define SPI7_BASE                   SPI7_BASE_NS

#define UART7                       UART7_NS
#define UART7_BASE                  UART7_BASE_NS

#define UART8                       UART8_NS
#define UART8_BASE                  UART8_BASE_NS

/*!< AHB2 peripherals defaults to Non secure aliases */
#define HPDMA1                      HPDMA1_NS
#define HPDMA1_BASE                 HPDMA1_BASE_NS

#define HPDMA2                      HPDMA2_NS
#define HPDMA2_BASE                 HPDMA2_BASE_NS

#define HPDMA3                      HPDMA3_NS
#define HPDMA3_BASE                 HPDMA3_BASE_NS

#define OCTOSPI1                    OCTOSPI1_NS
#define OCTOSPI1_BASE               OCTOSPI1_BASE_NS

#define OCTOSPI2                    OCTOSPI2_NS
#define OCTOSPI2_BASE               OCTOSPI2_BASE_NS
#define OTFDEC1                     OTFDEC1_NS
#define OTFDEC1_BASE                OTFDEC1_BASE_NS

#define OTFDEC1_REGION1             OTFDEC1_REGION1_NS
#define OTFDEC1_REGION1_BASE        OTFDEC1_REGION1_BASE_NS

#define OTFDEC1_REGION2             OTFDEC1_REGION2_NS
#define OTFDEC1_REGION2_BASE        OTFDEC1_REGION2_BASE_NS

#define OTFDEC1_REGION3             OTFDEC1_REGION3_NS
#define OTFDEC1_REGION3_BASE        OTFDEC1_REGION3_BASE_NS

#define OTFDEC1_REGION4             OTFDEC1_REGION4_NS
#define OTFDEC1_REGION4_BASE        OTFDEC1_REGION4_BASE_NS

#define OTFDEC2                     OTFDEC2_NS
#define OTFDEC2_BASE                OTFDEC2_BASE_NS

#define OTFDEC2_REGION1             OTFDEC2_REGION1_NS
#define OTFDEC2_REGION1_BASE        OTFDEC2_REGION1_BASE_NS

