STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251cxx_cm33.h
/******************  Bit definition for LTDC_LxRCR register  ******************/
#define LTDC_LxRCR_IMR_Pos            (0U)
#define LTDC_LxRCR_IMR_Msk            (0x1UL << LTDC_LxRCR_IMR_Pos) /*!< 0x00000001 */
#define LTDC_LxRCR_IMR                LTDC_LxRCR_IMR_Msk         /*!< immediate reload trigger */
#define LTDC_LxRCR_VBR_Pos            (1U)
#define LTDC_LxRCR_VBR_Msk            (0x1UL << LTDC_LxRCR_VBR_Pos) /*!< 0x00000002 */
#define LTDC_LxRCR_VBR                LTDC_LxRCR_VBR_Msk         /*!< vertical blanking reload request */
#define LTDC_LxRCR_GRMSK_Pos          (2U)
#define LTDC_LxRCR_GRMSK_Msk          (0x1UL << LTDC_LxRCR_GRMSK_Pos)   /*!< 0x00000004 */
#define LTDC_LxRCR_GRMSK              LTDC_LxRCR_GRMSK_Msk       /*!< shadow reload control, global (centralized) reload masked */

/******************  Bit definition for LTDC_LxCR register  *******************/
#define LTDC_LxCR_LEN_Pos             (0U)
#define LTDC_LxCR_LEN_Msk             (0x1UL << LTDC_LxCR_LEN_Pos)/*!< 0x00000001 */
#define LTDC_LxCR_LEN                 LTDC_LxCR_LEN_Msk          /*!< layer enable */
#define LTDC_LxCR_CKEN_Pos            (1U)
#define LTDC_LxCR_CKEN_Msk            (0x1UL << LTDC_LxCR_CKEN_Pos) /*!< 0x00000002 */
#define LTDC_LxCR_CKEN                LTDC_LxCR_CKEN_Msk         /*!< color keying enable */
#define LTDC_LxCR_VPDEN_Pos           (2U)
#define LTDC_LxCR_VPDEN_Msk           (0x1UL << LTDC_LxCR_VPDEN_Pos)  /*!< 0x00000004 */
#define LTDC_LxCR_VPDEN               LTDC_LxCR_VPDEN_Msk        /*!< vertical pixel duplication enable */
#define LTDC_LxCR_HPDEN_Pos           (3U)
#define LTDC_LxCR_HPDEN_Msk           (0x1UL << LTDC_LxCR_HPDEN_Pos)  /*!< 0x00000008 */
#define LTDC_LxCR_HPDEN               LTDC_LxCR_HPDEN_Msk        /*!< horizontal pixel duplication enable */
#define LTDC_LxCR_CLUTEN_Pos          (4U)
#define LTDC_LxCR_CLUTEN_Msk          (0x1UL << LTDC_LxCR_CLUTEN_Pos)   /*!< 0x00000010 */
#define LTDC_LxCR_CLUTEN              LTDC_LxCR_CLUTEN_Msk       /*!< color look-up table enable */
#define LTDC_LxCR_HMEN_Pos            (8U)
#define LTDC_LxCR_HMEN_Msk            (0x1UL << LTDC_LxCR_HMEN_Pos) /*!< 0x00000100 */
#define LTDC_LxCR_HMEN                LTDC_LxCR_HMEN_Msk         /*!< horizontal mirroring enable */
#define LTDC_LxCR_DCBEN_Pos           (9U)
#define LTDC_LxCR_DCBEN_Msk           (0x1UL << LTDC_LxCR_DCBEN_Pos)  /*!< 0x00000200 */
#define LTDC_LxCR_DCBEN               LTDC_LxCR_DCBEN_Msk        /*!< default color blending enable */
#define LTDC_LxCR_SCEN_Pos            (10U)
#define LTDC_LxCR_SCEN_Msk            (0x1UL << LTDC_LxCR_SCEN_Pos) /*!< 0x00000400 */
#define LTDC_LxCR_SCEN                LTDC_LxCR_SCEN_Msk         /*!< scaler enable */

/*****************  Bit definition for LTDC_LxWHPCR register  *****************/
#define LTDC_LxWHPCR_WHSTPOS_Pos      (0U)
#define LTDC_LxWHPCR_WHSTPOS_Msk      (0xFFFFUL << LTDC_LxWHPCR_WHSTPOS_Pos)          /*!< 0x0000FFFF */
#define LTDC_LxWHPCR_WHSTPOS          LTDC_LxWHPCR_WHSTPOS_Msk   /*!< window horizontal start position */
#define LTDC_LxWHPCR_WHSPPOS_Pos      (16U)
#define LTDC_LxWHPCR_WHSPPOS_Msk      (0xFFFFUL << LTDC_LxWHPCR_WHSPPOS_Pos)          /*!< 0xFFFF0000 */
#define LTDC_LxWHPCR_WHSPPOS          LTDC_LxWHPCR_WHSPPOS_Msk   /*!< window horizontal stop position */

/*****************  Bit definition for LTDC_LxWVPCR register  *****************/
#define LTDC_LxWVPCR_WVSTPOS_Pos      (0U)
#define LTDC_LxWVPCR_WVSTPOS_Msk      (0xFFFFUL << LTDC_LxWVPCR_WVSTPOS_Pos)          /*!< 0x0000FFFF */
#define LTDC_LxWVPCR_WVSTPOS          LTDC_LxWVPCR_WVSTPOS_Msk   /*!< window vertical start position */
#define LTDC_LxWVPCR_WVSPPOS_Pos      (16U)
#define LTDC_LxWVPCR_WVSPPOS_Msk      (0xFFFFUL << LTDC_LxWVPCR_WVSPPOS_Pos)          /*!< 0xFFFF0000 */
#define LTDC_LxWVPCR_WVSPPOS          LTDC_LxWVPCR_WVSPPOS_Msk   /*!< window vertical stop position */

/*****************  Bit definition for LTDC_LxCKCR register  ******************/
#define LTDC_LxCKCR_CKBLUE_Pos        (0U)
#define LTDC_LxCKCR_CKBLUE_Msk        (0xFFUL << LTDC_LxCKCR_CKBLUE_Pos)      /*!< 0x000000FF */
#define LTDC_LxCKCR_CKBLUE            LTDC_LxCKCR_CKBLUE_Msk     /*!< color key blue value */
#define LTDC_LxCKCR_CKGREEN_Pos       (8U)
#define LTDC_LxCKCR_CKGREEN_Msk       (0xFFUL << LTDC_LxCKCR_CKGREEN_Pos)       /*!< 0x0000FF00 */
#define LTDC_LxCKCR_CKGREEN           LTDC_LxCKCR_CKGREEN_Msk    /*!< color key green value */
#define LTDC_LxCKCR_CKRED_Pos         (16U)
#define LTDC_LxCKCR_CKRED_Msk         (0xFFUL << LTDC_LxCKCR_CKRED_Pos)     /*!< 0x00FF0000 */
#define LTDC_LxCKCR_CKRED             LTDC_LxCKCR_CKRED_Msk      /*!< color key red value */

/*****************  Bit definition for LTDC_LxPFCR register  ******************/
#define LTDC_LxPFCR_PF_Pos            (0U)
#define LTDC_LxPFCR_PF_Msk            (0x7UL << LTDC_LxPFCR_PF_Pos) /*!< 0x00000007 */
#define LTDC_LxPFCR_PF                LTDC_LxPFCR_PF_Msk         /*!< pixel format */

/*****************  Bit definition for LTDC_LxCACR register  ******************/
#define LTDC_LxCACR_CONSTA_Pos        (0U)
#define LTDC_LxCACR_CONSTA_Msk        (0xFFUL << LTDC_LxCACR_CONSTA_Pos)      /*!< 0x000000FF */
#define LTDC_LxCACR_CONSTA            LTDC_LxCACR_CONSTA_Msk     /*!< constant alpha */

/*****************  Bit definition for LTDC_LxDCCR register  ******************/
#define LTDC_LxDCCR_DCBLUE_Pos        (0U)
#define LTDC_LxDCCR_DCBLUE_Msk        (0xFFUL << LTDC_LxDCCR_DCBLUE_Pos)      /*!< 0x000000FF */
#define LTDC_LxDCCR_DCBLUE            LTDC_LxDCCR_DCBLUE_Msk     /*!< default color blue */
#define LTDC_LxDCCR_DCGREEN_Pos       (8U)
#define LTDC_LxDCCR_DCGREEN_Msk       (0xFFUL << LTDC_LxDCCR_DCGREEN_Pos)       /*!< 0x0000FF00 */
#define LTDC_LxDCCR_DCGREEN           LTDC_LxDCCR_DCGREEN_Msk    /*!< default color green */
#define LTDC_LxDCCR_DCRED_Pos         (16U)
#define LTDC_LxDCCR_DCRED_Msk         (0xFFUL << LTDC_LxDCCR_DCRED_Pos)     /*!< 0x00FF0000 */
#define LTDC_LxDCCR_DCRED             LTDC_LxDCCR_DCRED_Msk      /*!< default color red */
#define LTDC_LxDCCR_DCALPHA_Pos       (24U)
#define LTDC_LxDCCR_DCALPHA_Msk       (0xFFUL << LTDC_LxDCCR_DCALPHA_Pos)       /*!< 0xFF000000 */
#define LTDC_LxDCCR_DCALPHA           LTDC_LxDCCR_DCALPHA_Msk    /*!< default color alpha */

/*****************  Bit definition for LTDC_LxBFCR register  ******************/
#define LTDC_LxBFCR_BF2_Pos           (0U)
#define LTDC_LxBFCR_BF2_Msk           (0x7UL << LTDC_LxBFCR_BF2_Pos)  /*!< 0x00000007 */
#define LTDC_LxBFCR_BF2               LTDC_LxBFCR_BF2_Msk        /*!< blending factor 2  */
#define LTDC_LxBFCR_BF1_Pos           (8U)
#define LTDC_LxBFCR_BF1_Msk           (0x7UL << LTDC_LxBFCR_BF1_Pos)  /*!< 0x00000700 */
#define LTDC_LxBFCR_BF1               LTDC_LxBFCR_BF1_Msk        /*!< blending factor 1 */
#define LTDC_LxBFCR_BOR_Pos           (16U)
#define LTDC_LxBFCR_BOR_Msk           (0x7UL << LTDC_LxBFCR_BOR_Pos)  /*!< 0x00070000 */
#define LTDC_LxBFCR_BOR               LTDC_LxBFCR_BOR_Msk        /*!< blending order */

/*****************  Bit definition for LTDC_LxBLCR register  ******************/
#define LTDC_LxBLCR_BL_Pos            (0U)
#define LTDC_LxBLCR_BL_Msk            (0xFFUL << LTDC_LxBLCR_BL_Pos)  /*!< 0x000000FF */
#define LTDC_LxBLCR_BL                LTDC_LxBLCR_BL_Msk         /*!< burst length */

/******************  Bit definition for LTDC_LxPCR register  ******************/
#define LTDC_LxPCR_VPDEN_Pos          (1U)
#define LTDC_LxPCR_VPDEN_Msk          (0x1UL << LTDC_LxPCR_VPDEN_Pos)   /*!< 0x00000002 */
#define LTDC_LxPCR_VPDEN              LTDC_LxPCR_VPDEN_Msk       /*!< Vertical pixel duplication enable */
#define LTDC_LxPCR_HPDEN_Pos          (2U)
#define LTDC_LxPCR_HPDEN_Msk          (0x1UL << LTDC_LxPCR_HPDEN_Pos)   /*!< 0x00000004 */
#define LTDC_LxPCR_HPDEN              LTDC_LxPCR_HPDEN_Msk       /*!< Horizontal pixel duplication enable */
#define LTDC_LxPCR_YCEN_Pos           (3U)
#define LTDC_LxPCR_YCEN_Msk           (0x1UL << LTDC_LxPCR_YCEN_Pos)  /*!< 0x00000008 */
#define LTDC_LxPCR_YCEN               LTDC_LxPCR_YCEN_Msk        /*!< YCbCr-to-RGB conversion enable */
#define LTDC_LxPCR_YCM_Pos            (4U)
#define LTDC_LxPCR_YCM_Msk            (0x3UL << LTDC_LxPCR_YCM_Pos) /*!< 0x00000030 */
#define LTDC_LxPCR_YCM                LTDC_LxPCR_YCM_Msk         /*!< YCbCr conversion mode */
#define LTDC_LxPCR_YF_Pos             (6U)
#define LTDC_LxPCR_YF_Msk             (0x1UL << LTDC_LxPCR_YF_Pos)/*!< 0x00000040 */
#define LTDC_LxPCR_YF                 LTDC_LxPCR_YF_Msk          /*!< Y component first */
#define LTDC_LxPCR_CBF_Pos            (7U)
#define LTDC_LxPCR_CBF_Msk            (0x1UL << LTDC_LxPCR_CBF_Pos) /*!< 0x00000080 */
#define LTDC_LxPCR_CBF                LTDC_LxPCR_CBF_Msk         /*!< Cb component first */
#define LTDC_LxPCR_OF_Pos             (8U)
#define LTDC_LxPCR_OF_Msk             (0x1UL << LTDC_LxPCR_OF_Pos)/*!< 0x00000100 */
#define LTDC_LxPCR_OF                 LTDC_LxPCR_OF_Msk          /*!< Odd pixel first */
#define LTDC_LxPCR_YREN_Pos           (9U)
#define LTDC_LxPCR_YREN_Msk           (0x1UL << LTDC_LxPCR_YREN_Pos)  /*!< 0x00000200 */
#define LTDC_LxPCR_YREN               LTDC_LxPCR_YREN_Msk        /*!< Y rescale enable for the color dynamic range */

/*****************  Bit definition for LTDC_LxCFBAR register  *****************/
#define LTDC_LxCFBAR_CFBADD_Pos       (0U)
#define LTDC_LxCFBAR_CFBADD_Msk       (0xFFFFFFFFUL << LTDC_LxCFBAR_CFBADD_Pos)             /*!< 0xFFFFFFFF */
#define LTDC_LxCFBAR_CFBADD           LTDC_LxCFBAR_CFBADD_Msk    /*!< color frame buffer start address */

/*****************  Bit definition for LTDC_LxCFBLR register  *****************/
#define LTDC_LxCFBLR_CFBLL_Pos        (0U)
#define LTDC_LxCFBLR_CFBLL_Msk        (0xFFFFUL << LTDC_LxCFBLR_CFBLL_Pos)        /*!< 0x0000FFFF */
#define LTDC_LxCFBLR_CFBLL            LTDC_LxCFBLR_CFBLL_Msk     /*!< color frame buffer line length */
#define LTDC_LxCFBLR_CFBP_Pos         (16U)
#define LTDC_LxCFBLR_CFBP_Msk         (0xFFFFUL << LTDC_LxCFBLR_CFBP_Pos)       /*!< 0xFFFF0000 */
#define LTDC_LxCFBLR_CFBP             LTDC_LxCFBLR_CFBP_Msk      /*!< color frame buffer pitch in bytes */

