STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251cxx_cm33.h
/* Bit fields for PWR_WIO1SEMCR register */
#define PWR_WIO1SEMCR_SEMCID_CID1       (RIF_CID_CPU1_CA35 << PWR_WIO1SEMCR_SEMCID_Pos)
#define PWR_WIO1SEMCR_SEMCID_CID2       (RIF_CID_CPU2_CM33 << PWR_WIO1SEMCR_SEMCID_Pos)
#define PWR_WIO1SEMCR_SEMCID_CID3       (RIF_CID_CPU3_CM0  << PWR_WIO1SEMCR_SEMCID_Pos)
#define PWR_WIO1SEMCR_SEMCID_CURRENT    PWR_WIO1SEMCR_SEMCID_CID2

#define PWR_WIO1SEMCR_SEM_MUTEX_Pos            (0U)
#define PWR_WIO1SEMCR_SEM_MUTEX_Msk            (0x1UL << PWR_WIO1SEMCR_SEM_MUTEX_Pos)
#define PWR_WIO1SEMCR_SEM_MUTEX                PWR_WIO1SEMCR_SEM_MUTEX_Msk  /*!< Semaphore mutexApplication can set semaphore bit to get exclusive access to Wakeup IO x when SEM_EN is set in PWR_WIOxCIDCFGR (writes are ignored otherwise).Read 0: Semaphore is free to takeRead 1: Semaphore is takenWrite 0: Release semaphoreWrite 1: Acquire semaphoreWhen SEM_MUTEX=0 only applications belonging to white-listed compartments (defined with SEMWLCy bits in PWR_WIOxCIDCFGR) can acquire this semaphore.When SEM_MUTEX=1 only applications belonging to compartment SEMCID can release this semaphore.This bit is cleared when CFEN or SEM_EN are cleared from 1 in PWR_WIOxCIDCFGR. */
#define PWR_WIO1SEMCR_SEMCID_Pos               (4U)
#define PWR_WIO1SEMCR_SEMCID_Msk               (0x7UL << PWR_WIO1SEMCR_SEMCID_Pos)
#define PWR_WIO1SEMCR_SEMCID                   PWR_WIO1SEMCR_SEMCID_Msk  /*!< Semaphore Current Compartment IDWhen SEM_EN=1, this read-only bit field is updated with the CID value of the latest successfulacquisition of PWR_WIOxSEMCR semaphore (SEM_MUTEX bit set to 1). */

/* Bit fields for PWR_WIO2CIDCFGR register */
#define PWR_WIO2CIDCFGR_CFEN_Pos               (0U)
#define PWR_WIO2CIDCFGR_CFEN_Msk               (0x1UL << PWR_WIO2CIDCFGR_CFEN_Pos)
#define PWR_WIO2CIDCFGR_CFEN                   PWR_WIO2CIDCFGR_CFEN_Msk  /*!< Compartment ID filter enable- 0: Compartment-based filtering is disabled for Wakeup IO x.- 1: Compartment-based filtering is enabled for Wakeup IO x. */
#define PWR_WIO2CIDCFGR_SEM_EN_Pos             (1U)
#define PWR_WIO2CIDCFGR_SEM_EN_Msk             (0x1UL << PWR_WIO2CIDCFGR_SEM_EN_Pos)
#define PWR_WIO2CIDCFGR_SEM_EN                 PWR_WIO2CIDCFGR_SEM_EN_Msk  /*!< Semaphore enable- 0: Access to Wakeup IO x is granted only if CID of the access equals to SCID.- 1: Access to Wakeup IO x is granted only if SEM_MUTEX=1 and CID of the access equals to SEMCID.This bit is ignored if CFEN=0. When this bit is cleared from 1 SEM_MUTEX is cleared. */
#define PWR_WIO2CIDCFGR_SCID_Pos               (4U)
#define PWR_WIO2CIDCFGR_SCID_Msk               (0x7UL << PWR_WIO2CIDCFGR_SCID_Pos)
#define PWR_WIO2CIDCFGR_SCID                   PWR_WIO2CIDCFGR_SCID_Msk  /*!< Static compartment identifierTrusted domain application uses this bitfield to statically define which compartment has accessto the peripheral x when SEM_EN=0.This bit field is ignored if SEM_EN=1 or CFEN=0. */
#define PWR_WIO2CIDCFGR_SEMWLC0_Pos            (16U)
#define PWR_WIO2CIDCFGR_SEMWLC0_Msk            (0x1UL << PWR_WIO2CIDCFGR_SEMWLC0_Pos)
#define PWR_WIO2CIDCFGR_SEMWLC0                PWR_WIO2CIDCFGR_SEMWLC0_Msk  /*!< Semaphore compartment ID 0 enable- 0: The Compartment ID 0 agent is disabled to take the semaphore- 1: The Compartment ID 0 agent is enabled to take the semaphore */
#define PWR_WIO2CIDCFGR_SEMWLC1_Pos            (17U)
#define PWR_WIO2CIDCFGR_SEMWLC1_Msk            (0x1UL << PWR_WIO2CIDCFGR_SEMWLC1_Pos)
#define PWR_WIO2CIDCFGR_SEMWLC1                PWR_WIO2CIDCFGR_SEMWLC1_Msk  /*!< Semaphore compartment ID 1 enable- 0: The Compartment ID 1 agent is disabled to take the semaphore- 1: The Compartment ID 1 agent is enabled to take the semaphore */
#define PWR_WIO2CIDCFGR_SEMWLC2_Pos            (18U)
#define PWR_WIO2CIDCFGR_SEMWLC2_Msk            (0x1UL << PWR_WIO2CIDCFGR_SEMWLC2_Pos)
#define PWR_WIO2CIDCFGR_SEMWLC2                PWR_WIO2CIDCFGR_SEMWLC2_Msk  /*!< Semaphore compartment ID 2 enable- 0: The Compartment ID 2 agent is disabled to take the semaphore- 1: The Compartment ID 2 agent is enabled to take the semaphore */
#define PWR_WIO2CIDCFGR_SEMWLC3_Pos            (19U)
#define PWR_WIO2CIDCFGR_SEMWLC3_Msk            (0x1UL << PWR_WIO2CIDCFGR_SEMWLC3_Pos)
#define PWR_WIO2CIDCFGR_SEMWLC3                PWR_WIO2CIDCFGR_SEMWLC3_Msk  /*!< Semaphore compartment ID 3 enable- 0: The Compartment ID 3 agent is disabled to take the semaphore- 1: The Compartment ID 3 agent is enabled to take the semaphore */
#define PWR_WIO2CIDCFGR_SEMWLC4_Pos            (20U)
#define PWR_WIO2CIDCFGR_SEMWLC4_Msk            (0x1UL << PWR_WIO2CIDCFGR_SEMWLC4_Pos)
#define PWR_WIO2CIDCFGR_SEMWLC4                PWR_WIO2CIDCFGR_SEMWLC4_Msk  /*!< Semaphore compartment ID 4 enable- 0: The Compartment ID 4 agent is disabled to take the semaphore- 1: The Compartment ID 4 agent is enabled to take the semaphore */
#define PWR_WIO2CIDCFGR_SEMWLC5_Pos            (21U)
#define PWR_WIO2CIDCFGR_SEMWLC5_Msk            (0x1UL << PWR_WIO2CIDCFGR_SEMWLC5_Pos)
#define PWR_WIO2CIDCFGR_SEMWLC5                PWR_WIO2CIDCFGR_SEMWLC5_Msk  /*!< Semaphore compartment ID 5 enable- 0: The Compartment ID 5 agent is disabled to take the semaphore- 1: The Compartment ID 5 agent is enabled to take the semaphore */
#define PWR_WIO2CIDCFGR_SEMWLC6_Pos            (22U)
#define PWR_WIO2CIDCFGR_SEMWLC6_Msk            (0x1UL << PWR_WIO2CIDCFGR_SEMWLC6_Pos)
#define PWR_WIO2CIDCFGR_SEMWLC6                PWR_WIO2CIDCFGR_SEMWLC6_Msk  /*!< Semaphore compartment ID 6 enable- 0: The Compartment ID 6 agent is disabled to take the semaphore- 1: The Compartment ID 6 agent is enabled to take the semaphore */
#define PWR_WIO2CIDCFGR_SEMWLC7_Pos            (23U)
#define PWR_WIO2CIDCFGR_SEMWLC7_Msk            (0x1UL << PWR_WIO2CIDCFGR_SEMWLC7_Pos)
#define PWR_WIO2CIDCFGR_SEMWLC7                PWR_WIO2CIDCFGR_SEMWLC7_Msk  /*!< Semaphore Compartment ID 7 enable- 0: The Compartment ID 7 agent is disabled to take the semaphore- 1: The Compartment ID 7 agent is enabled to take the semaphore */

/* Bit fields for PWR_WIO2SEMCR register */
#define PWR_WIO2SEMCR_SEM_MUTEX_Pos            (0U)
#define PWR_WIO2SEMCR_SEM_MUTEX_Msk            (0x1UL << PWR_WIO2SEMCR_SEM_MUTEX_Pos)
#define PWR_WIO2SEMCR_SEM_MUTEX                PWR_WIO2SEMCR_SEM_MUTEX_Msk  /*!< Semaphore mutexApplication can set semaphore bit to get exclusive access to Wakeup IO x when SEM_EN is set in PWR_WIOxCIDCFGR (writes are ignored otherwise).Read 0: Semaphore is free to takeRead 1: Semaphore is takenWrite 0: Release semaphoreWrite 1: Acquire semaphoreWhen SEM_MUTEX=0 only applications belonging to white-listed compartments (defined with SEMWLCy bits in PWR_WIOxCIDCFGR) can acquire this semaphore.When SEM_MUTEX=1 only applications belonging to compartment SEMCID can release this semaphore.This bit is cleared when CFEN or SEM_EN are cleared from 1 in PWR_WIOxCIDCFGR. */
#define PWR_WIO2SEMCR_SEMCID_Pos               (4U)
#define PWR_WIO2SEMCR_SEMCID_Msk               (0x7UL << PWR_WIO2SEMCR_SEMCID_Pos)
#define PWR_WIO2SEMCR_SEMCID                   PWR_WIO2SEMCR_SEMCID_Msk  /*!< Semaphore Current Compartment IDWhen SEM_EN=1, this read-only bit field is updated with the CID value of the latest successfulacquisition of PWR_WIOxSEMCR semaphore (SEM_MUTEX bit set to 1). */

/* Bit fields for PWR_WIO3CIDCFGR register */
#define PWR_WIO3CIDCFGR_CFEN_Pos               (0U)
#define PWR_WIO3CIDCFGR_CFEN_Msk               (0x1UL << PWR_WIO3CIDCFGR_CFEN_Pos)
#define PWR_WIO3CIDCFGR_CFEN                   PWR_WIO3CIDCFGR_CFEN_Msk  /*!< Compartment ID filter enable- 0: Compartment-based filtering is disabled for Wakeup IO x.- 1: Compartment-based filtering is enabled for Wakeup IO x. */
#define PWR_WIO3CIDCFGR_SEM_EN_Pos             (1U)
#define PWR_WIO3CIDCFGR_SEM_EN_Msk             (0x1UL << PWR_WIO3CIDCFGR_SEM_EN_Pos)
#define PWR_WIO3CIDCFGR_SEM_EN                 PWR_WIO3CIDCFGR_SEM_EN_Msk  /*!< Semaphore enable- 0: Access to Wakeup IO x is granted only if CID of the access equals to SCID.- 1: Access to Wakeup IO x is granted only if SEM_MUTEX=1 and CID of the access equals to SEMCID.This bit is ignored if CFEN=0. When this bit is cleared from 1 SEM_MUTEX is cleared. */
#define PWR_WIO3CIDCFGR_SCID_Pos               (4U)
#define PWR_WIO3CIDCFGR_SCID_Msk               (0x7UL << PWR_WIO3CIDCFGR_SCID_Pos)
#define PWR_WIO3CIDCFGR_SCID                   PWR_WIO3CIDCFGR_SCID_Msk  /*!< Static compartment identifierTrusted domain application uses this bitfield to statically define which compartment has accessto the peripheral x when SEM_EN=0.This bit field is ignored if SEM_EN=1 or CFEN=0. */
#define PWR_WIO3CIDCFGR_SEMWLC0_Pos            (16U)
#define PWR_WIO3CIDCFGR_SEMWLC0_Msk            (0x1UL << PWR_WIO3CIDCFGR_SEMWLC0_Pos)
#define PWR_WIO3CIDCFGR_SEMWLC0                PWR_WIO3CIDCFGR_SEMWLC0_Msk  /*!< Semaphore compartment ID 0 enable- 0: The Compartment ID 0 agent is disabled to take the semaphore- 1: The Compartment ID 0 agent is enabled to take the semaphore */
#define PWR_WIO3CIDCFGR_SEMWLC1_Pos            (17U)
#define PWR_WIO3CIDCFGR_SEMWLC1_Msk            (0x1UL << PWR_WIO3CIDCFGR_SEMWLC1_Pos)
#define PWR_WIO3CIDCFGR_SEMWLC1                PWR_WIO3CIDCFGR_SEMWLC1_Msk  /*!< Semaphore compartment ID 1 enable- 0: The Compartment ID 1 agent is disabled to take the semaphore- 1: The Compartment ID 1 agent is enabled to take the semaphore */
#define PWR_WIO3CIDCFGR_SEMWLC2_Pos            (18U)
#define PWR_WIO3CIDCFGR_SEMWLC2_Msk            (0x1UL << PWR_WIO3CIDCFGR_SEMWLC2_Pos)
#define PWR_WIO3CIDCFGR_SEMWLC2                PWR_WIO3CIDCFGR_SEMWLC2_Msk  /*!< Semaphore compartment ID 2 enable- 0: The Compartment ID 2 agent is disabled to take the semaphore- 1: The Compartment ID 2 agent is enabled to take the semaphore */
#define PWR_WIO3CIDCFGR_SEMWLC3_Pos            (19U)
#define PWR_WIO3CIDCFGR_SEMWLC3_Msk            (0x1UL << PWR_WIO3CIDCFGR_SEMWLC3_Pos)
#define PWR_WIO3CIDCFGR_SEMWLC3                PWR_WIO3CIDCFGR_SEMWLC3_Msk  /*!< Semaphore compartment ID 3 enable- 0: The Compartment ID 3 agent is disabled to take the semaphore- 1: The Compartment ID 3 agent is enabled to take the semaphore */
#define PWR_WIO3CIDCFGR_SEMWLC4_Pos            (20U)
#define PWR_WIO3CIDCFGR_SEMWLC4_Msk            (0x1UL << PWR_WIO3CIDCFGR_SEMWLC4_Pos)
#define PWR_WIO3CIDCFGR_SEMWLC4                PWR_WIO3CIDCFGR_SEMWLC4_Msk  /*!< Semaphore compartment ID 4 enable- 0: The Compartment ID 4 agent is disabled to take the semaphore- 1: The Compartment ID 4 agent is enabled to take the semaphore */
#define PWR_WIO3CIDCFGR_SEMWLC5_Pos            (21U)
#define PWR_WIO3CIDCFGR_SEMWLC5_Msk            (0x1UL << PWR_WIO3CIDCFGR_SEMWLC5_Pos)
#define PWR_WIO3CIDCFGR_SEMWLC5                PWR_WIO3CIDCFGR_SEMWLC5_Msk  /*!< Semaphore compartment ID 5 enable- 0: The Compartment ID 5 agent is disabled to take the semaphore- 1: The Compartment ID 5 agent is enabled to take the semaphore */
#define PWR_WIO3CIDCFGR_SEMWLC6_Pos            (22U)
#define PWR_WIO3CIDCFGR_SEMWLC6_Msk            (0x1UL << PWR_WIO3CIDCFGR_SEMWLC6_Pos)
#define PWR_WIO3CIDCFGR_SEMWLC6                PWR_WIO3CIDCFGR_SEMWLC6_Msk  /*!< Semaphore compartment ID 6 enable- 0: The Compartment ID 6 agent is disabled to take the semaphore- 1: The Compartment ID 6 agent is enabled to take the semaphore */
#define PWR_WIO3CIDCFGR_SEMWLC7_Pos            (23U)
#define PWR_WIO3CIDCFGR_SEMWLC7_Msk            (0x1UL << PWR_WIO3CIDCFGR_SEMWLC7_Pos)
#define PWR_WIO3CIDCFGR_SEMWLC7                PWR_WIO3CIDCFGR_SEMWLC7_Msk  /*!< Semaphore Compartment ID 7 enable- 0: The Compartment ID 7 agent is disabled to take the semaphore- 1: The Compartment ID 7 agent is enabled to take the semaphore */

/* Bit fields for PWR_WIO3SEMCR register */
#define PWR_WIO3SEMCR_SEM_MUTEX_Pos            (0U)
#define PWR_WIO3SEMCR_SEM_MUTEX_Msk            (0x1UL << PWR_WIO3SEMCR_SEM_MUTEX_Pos)
#define PWR_WIO3SEMCR_SEM_MUTEX                PWR_WIO3SEMCR_SEM_MUTEX_Msk  /*!< Semaphore mutexApplication can set semaphore bit to get exclusive access to Wakeup IO x when SEM_EN is set in PWR_WIOxCIDCFGR (writes are ignored otherwise).Read 0: Semaphore is free to takeRead 1: Semaphore is takenWrite 0: Release semaphoreWrite 1: Acquire semaphoreWhen SEM_MUTEX=0 only applications belonging to white-listed compartments (defined with SEMWLCy bits in PWR_WIOxCIDCFGR) can acquire this semaphore.When SEM_MUTEX=1 only applications belonging to compartment SEMCID can release this semaphore.This bit is cleared when CFEN or SEM_EN are cleared from 1 in PWR_WIOxCIDCFGR. */
#define PWR_WIO3SEMCR_SEMCID_Pos               (4U)
#define PWR_WIO3SEMCR_SEMCID_Msk               (0x7UL << PWR_WIO3SEMCR_SEMCID_Pos)
#define PWR_WIO3SEMCR_SEMCID                   PWR_WIO3SEMCR_SEMCID_Msk  /*!< Semaphore Current Compartment IDWhen SEM_EN=1, this read-only bit field is updated with the CID value of the latest successfulacquisition of PWR_WIOxSEMCR semaphore (SEM_MUTEX bit set to 1). */

/* Bit fields for PWR_WIO4CIDCFGR register */
#define PWR_WIO4CIDCFGR_CFEN_Pos               (0U)
#define PWR_WIO4CIDCFGR_CFEN_Msk               (0x1UL << PWR_WIO4CIDCFGR_CFEN_Pos)
#define PWR_WIO4CIDCFGR_CFEN                   PWR_WIO4CIDCFGR_CFEN_Msk  /*!< Compartment ID filter enable- 0: Compartment-based filtering is disabled for Wakeup IO x.- 1: Compartment-based filtering is enabled for Wakeup IO x. */
#define PWR_WIO4CIDCFGR_SEM_EN_Pos             (1U)
#define PWR_WIO4CIDCFGR_SEM_EN_Msk             (0x1UL << PWR_WIO4CIDCFGR_SEM_EN_Pos)
#define PWR_WIO4CIDCFGR_SEM_EN                 PWR_WIO4CIDCFGR_SEM_EN_Msk  /*!< Semaphore enable- 0: Access to Wakeup IO x is granted only if CID of the access equals to SCID.- 1: Access to Wakeup IO x is granted only if SEM_MUTEX=1 and CID of the access equals to SEMCID.This bit is ignored if CFEN=0. When this bit is cleared from 1 SEM_MUTEX is cleared. */
#define PWR_WIO4CIDCFGR_SCID_Pos               (4U)
#define PWR_WIO4CIDCFGR_SCID_Msk               (0x7UL << PWR_WIO4CIDCFGR_SCID_Pos)
#define PWR_WIO4CIDCFGR_SCID                   PWR_WIO4CIDCFGR_SCID_Msk  /*!< Static compartment identifierTrusted domain application uses this bitfield to statically define which compartment has accessto the peripheral x when SEM_EN=0.This bit field is ignored if SEM_EN=1 or CFEN=0. */
#define PWR_WIO4CIDCFGR_SEMWLC0_Pos            (16U)
#define PWR_WIO4CIDCFGR_SEMWLC0_Msk            (0x1UL << PWR_WIO4CIDCFGR_SEMWLC0_Pos)
#define PWR_WIO4CIDCFGR_SEMWLC0                PWR_WIO4CIDCFGR_SEMWLC0_Msk  /*!< Semaphore compartment ID 0 enable- 0: The Compartment ID 0 agent is disabled to take the semaphore- 1: The Compartment ID 0 agent is enabled to take the semaphore */
#define PWR_WIO4CIDCFGR_SEMWLC1_Pos            (17U)
#define PWR_WIO4CIDCFGR_SEMWLC1_Msk            (0x1UL << PWR_WIO4CIDCFGR_SEMWLC1_Pos)
#define PWR_WIO4CIDCFGR_SEMWLC1                PWR_WIO4CIDCFGR_SEMWLC1_Msk  /*!< Semaphore compartment ID 1 enable- 0: The Compartment ID 1 agent is disabled to take the semaphore- 1: The Compartment ID 1 agent is enabled to take the semaphore */
#define PWR_WIO4CIDCFGR_SEMWLC2_Pos            (18U)
#define PWR_WIO4CIDCFGR_SEMWLC2_Msk            (0x1UL << PWR_WIO4CIDCFGR_SEMWLC2_Pos)
#define PWR_WIO4CIDCFGR_SEMWLC2                PWR_WIO4CIDCFGR_SEMWLC2_Msk  /*!< Semaphore compartment ID 2 enable- 0: The Compartment ID 2 agent is disabled to take the semaphore- 1: The Compartment ID 2 agent is enabled to take the semaphore */
#define PWR_WIO4CIDCFGR_SEMWLC3_Pos            (19U)
#define PWR_WIO4CIDCFGR_SEMWLC3_Msk            (0x1UL << PWR_WIO4CIDCFGR_SEMWLC3_Pos)
#define PWR_WIO4CIDCFGR_SEMWLC3                PWR_WIO4CIDCFGR_SEMWLC3_Msk  /*!< Semaphore compartment ID 3 enable- 0: The Compartment ID 3 agent is disabled to take the semaphore- 1: The Compartment ID 3 agent is enabled to take the semaphore */
#define PWR_WIO4CIDCFGR_SEMWLC4_Pos            (20U)
#define PWR_WIO4CIDCFGR_SEMWLC4_Msk            (0x1UL << PWR_WIO4CIDCFGR_SEMWLC4_Pos)
#define PWR_WIO4CIDCFGR_SEMWLC4                PWR_WIO4CIDCFGR_SEMWLC4_Msk  /*!< Semaphore compartment ID 4 enable- 0: The Compartment ID 4 agent is disabled to take the semaphore- 1: The Compartment ID 4 agent is enabled to take the semaphore */
#define PWR_WIO4CIDCFGR_SEMWLC5_Pos            (21U)
#define PWR_WIO4CIDCFGR_SEMWLC5_Msk            (0x1UL << PWR_WIO4CIDCFGR_SEMWLC5_Pos)
#define PWR_WIO4CIDCFGR_SEMWLC5                PWR_WIO4CIDCFGR_SEMWLC5_Msk  /*!< Semaphore compartment ID 5 enable- 0: The Compartment ID 5 agent is disabled to take the semaphore- 1: The Compartment ID 5 agent is enabled to take the semaphore */
#define PWR_WIO4CIDCFGR_SEMWLC6_Pos            (22U)
#define PWR_WIO4CIDCFGR_SEMWLC6_Msk            (0x1UL << PWR_WIO4CIDCFGR_SEMWLC6_Pos)
#define PWR_WIO4CIDCFGR_SEMWLC6                PWR_WIO4CIDCFGR_SEMWLC6_Msk  /*!< Semaphore compartment ID 6 enable- 0: The Compartment ID 6 agent is disabled to take the semaphore- 1: The Compartment ID 6 agent is enabled to take the semaphore */
#define PWR_WIO4CIDCFGR_SEMWLC7_Pos            (23U)
#define PWR_WIO4CIDCFGR_SEMWLC7_Msk            (0x1UL << PWR_WIO4CIDCFGR_SEMWLC7_Pos)
#define PWR_WIO4CIDCFGR_SEMWLC7                PWR_WIO4CIDCFGR_SEMWLC7_Msk  /*!< Semaphore Compartment ID 7 enable- 0: The Compartment ID 7 agent is disabled to take the semaphore- 1: The Compartment ID 7 agent is enabled to take the semaphore */

/* Bit fields for PWR_WIO4SEMCR register */
#define PWR_WIO4SEMCR_SEM_MUTEX_Pos            (0U)
#define PWR_WIO4SEMCR_SEM_MUTEX_Msk            (0x1UL << PWR_WIO4SEMCR_SEM_MUTEX_Pos)
#define PWR_WIO4SEMCR_SEM_MUTEX                PWR_WIO4SEMCR_SEM_MUTEX_Msk  /*!< Semaphore mutexApplication can set semaphore bit to get exclusive access to Wakeup IO x when SEM_EN is set in PWR_WIOxCIDCFGR (writes are ignored otherwise).Read 0: Semaphore is free to takeRead 1: Semaphore is takenWrite 0: Release semaphoreWrite 1: Acquire semaphoreWhen SEM_MUTEX=0 only applications belonging to white-listed compartments (defined with SEMWLCy bits in PWR_WIOxCIDCFGR) can acquire this semaphore.When SEM_MUTEX=1 only applications belonging to compartment SEMCID can release this semaphore.This bit is cleared when CFEN or SEM_EN are cleared from 1 in PWR_WIOxCIDCFGR. */
#define PWR_WIO4SEMCR_SEMCID_Pos               (4U)
#define PWR_WIO4SEMCR_SEMCID_Msk               (0x7UL << PWR_WIO4SEMCR_SEMCID_Pos)
#define PWR_WIO4SEMCR_SEMCID                   PWR_WIO4SEMCR_SEMCID_Msk  /*!< Semaphore Current Compartment IDWhen SEM_EN=1, this read-only bit field is updated with the CID value of the latest successfulacquisition of PWR_WIOxSEMCR semaphore (SEM_MUTEX bit set to 1). */

/* Bit fields for PWR_WIO5CIDCFGR register */
#define PWR_WIO5CIDCFGR_CFEN_Pos               (0U)
#define PWR_WIO5CIDCFGR_CFEN_Msk               (0x1UL << PWR_WIO5CIDCFGR_CFEN_Pos)
#define PWR_WIO5CIDCFGR_CFEN                   PWR_WIO5CIDCFGR_CFEN_Msk  /*!< Compartment ID filter enable- 0: Compartment-based filtering is disabled for Wakeup IO x.- 1: Compartment-based filtering is enabled for Wakeup IO x. */
#define PWR_WIO5CIDCFGR_SEM_EN_Pos             (1U)
#define PWR_WIO5CIDCFGR_SEM_EN_Msk             (0x1UL << PWR_WIO5CIDCFGR_SEM_EN_Pos)
#define PWR_WIO5CIDCFGR_SEM_EN                 PWR_WIO5CIDCFGR_SEM_EN_Msk  /*!< Semaphore enable- 0: Access to Wakeup IO x is granted only if CID of the access equals to SCID.- 1: Access to Wakeup IO x is granted only if SEM_MUTEX=1 and CID of the access equals to SEMCID.This bit is ignored if CFEN=0. When this bit is cleared from 1 SEM_MUTEX is cleared. */
#define PWR_WIO5CIDCFGR_SCID_Pos               (4U)
#define PWR_WIO5CIDCFGR_SCID_Msk               (0x7UL << PWR_WIO5CIDCFGR_SCID_Pos)
#define PWR_WIO5CIDCFGR_SCID                   PWR_WIO5CIDCFGR_SCID_Msk  /*!< Static compartment identifierTrusted domain application uses this bitfield to statically define which compartment has accessto the peripheral x when SEM_EN=0.This bit field is ignored if SEM_EN=1 or CFEN=0. */
#define PWR_WIO5CIDCFGR_SEMWLC0_Pos            (16U)
#define PWR_WIO5CIDCFGR_SEMWLC0_Msk            (0x1UL << PWR_WIO5CIDCFGR_SEMWLC0_Pos)
#define PWR_WIO5CIDCFGR_SEMWLC0                PWR_WIO5CIDCFGR_SEMWLC0_Msk  /*!< Semaphore compartment ID 0 enable- 0: The Compartment ID 0 agent is disabled to take the semaphore- 1: The Compartment ID 0 agent is enabled to take the semaphore */
#define PWR_WIO5CIDCFGR_SEMWLC1_Pos            (17U)
#define PWR_WIO5CIDCFGR_SEMWLC1_Msk            (0x1UL << PWR_WIO5CIDCFGR_SEMWLC1_Pos)
#define PWR_WIO5CIDCFGR_SEMWLC1                PWR_WIO5CIDCFGR_SEMWLC1_Msk  /*!< Semaphore compartment ID 1 enable- 0: The Compartment ID 1 agent is disabled to take the semaphore- 1: The Compartment ID 1 agent is enabled to take the semaphore */
#define PWR_WIO5CIDCFGR_SEMWLC2_Pos            (18U)
#define PWR_WIO5CIDCFGR_SEMWLC2_Msk            (0x1UL << PWR_WIO5CIDCFGR_SEMWLC2_Pos)
#define PWR_WIO5CIDCFGR_SEMWLC2                PWR_WIO5CIDCFGR_SEMWLC2_Msk  /*!< Semaphore compartment ID 2 enable- 0: The Compartment ID 2 agent is disabled to take the semaphore- 1: The Compartment ID 2 agent is enabled to take the semaphore */
#define PWR_WIO5CIDCFGR_SEMWLC3_Pos            (19U)
#define PWR_WIO5CIDCFGR_SEMWLC3_Msk            (0x1UL << PWR_WIO5CIDCFGR_SEMWLC3_Pos)
#define PWR_WIO5CIDCFGR_SEMWLC3                PWR_WIO5CIDCFGR_SEMWLC3_Msk  /*!< Semaphore compartment ID 3 enable- 0: The Compartment ID 3 agent is disabled to take the semaphore- 1: The Compartment ID 3 agent is enabled to take the semaphore */
#define PWR_WIO5CIDCFGR_SEMWLC4_Pos            (20U)
#define PWR_WIO5CIDCFGR_SEMWLC4_Msk            (0x1UL << PWR_WIO5CIDCFGR_SEMWLC4_Pos)
#define PWR_WIO5CIDCFGR_SEMWLC4                PWR_WIO5CIDCFGR_SEMWLC4_Msk  /*!< Semaphore compartment ID 4 enable- 0: The Compartment ID 4 agent is disabled to take the semaphore- 1: The Compartment ID 4 agent is enabled to take the semaphore */
#define PWR_WIO5CIDCFGR_SEMWLC5_Pos            (21U)
#define PWR_WIO5CIDCFGR_SEMWLC5_Msk            (0x1UL << PWR_WIO5CIDCFGR_SEMWLC5_Pos)
#define PWR_WIO5CIDCFGR_SEMWLC5                PWR_WIO5CIDCFGR_SEMWLC5_Msk  /*!< Semaphore compartment ID 5 enable- 0: The Compartment ID 5 agent is disabled to take the semaphore- 1: The Compartment ID 5 agent is enabled to take the semaphore */
#define PWR_WIO5CIDCFGR_SEMWLC6_Pos            (22U)
#define PWR_WIO5CIDCFGR_SEMWLC6_Msk            (0x1UL << PWR_WIO5CIDCFGR_SEMWLC6_Pos)
#define PWR_WIO5CIDCFGR_SEMWLC6                PWR_WIO5CIDCFGR_SEMWLC6_Msk  /*!< Semaphore compartment ID 6 enable- 0: The Compartment ID 6 agent is disabled to take the semaphore- 1: The Compartment ID 6 agent is enabled to take the semaphore */
#define PWR_WIO5CIDCFGR_SEMWLC7_Pos            (23U)
#define PWR_WIO5CIDCFGR_SEMWLC7_Msk            (0x1UL << PWR_WIO5CIDCFGR_SEMWLC7_Pos)
#define PWR_WIO5CIDCFGR_SEMWLC7                PWR_WIO5CIDCFGR_SEMWLC7_Msk  /*!< Semaphore Compartment ID 7 enable- 0: The Compartment ID 7 agent is disabled to take the semaphore- 1: The Compartment ID 7 agent is enabled to take the semaphore */

