STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251cxx_cm33.h
/******************* TIM Instances : Timer input selection ********************/
#define IS_TIM_TISEL_INSTANCE(INSTANCE)      (((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                              ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                              ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                              ((INSTANCE) == TIM12_S) || ((INSTANCE) == TIM12_NS) || \
                                              ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS) || \
                                              ((INSTANCE) == TIM16_S) || ((INSTANCE) == TIM16_NS) || \
                                              ((INSTANCE) == TIM17_S) || ((INSTANCE) == TIM14_NS))

/****************** TIM Instances : Advanced timer instances *******************/
#define IS_TIM_ADVANCED_INSTANCE(INSTANCE)       (((INSTANCE) == TIM1_S)  || ((INSTANCE) == TIM1_NS) || \
                                                  ((INSTANCE) == TIM8_S)  || ((INSTANCE) == TIM8_NS) || \
                                                  ((INSTANCE) == TIM20_S) || ((INSTANCE) == TIM20_NS))

/******************** USART Instances : Synchronous mode **********************/
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S) || ((INSTANCE) == USART1_NS) || \
                                     ((INSTANCE) == USART2_S) || ((INSTANCE) == USART2_NS) || \
                                     ((INSTANCE) == USART3_S) || ((INSTANCE) == USART3_NS) || \
                                     ((INSTANCE) == USART6_S) || ((INSTANCE) == USART6_NS))

/******************** UART Instances : Asynchronous mode **********************/
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S) || ((INSTANCE) == USART1_NS)|| \
                                    ((INSTANCE) == USART2_S) || ((INSTANCE) == USART2_NS)|| \
                                    ((INSTANCE) == USART3_S) || ((INSTANCE) == USART3_NS)|| \
                                    ((INSTANCE) == USART6_S) || ((INSTANCE) == USART6_NS)|| \
                                    ((INSTANCE) == UART4_S)  || ((INSTANCE) == UART4_NS) || \
                                    ((INSTANCE) == UART5_S)  || ((INSTANCE) == UART5_NS) || \
                                    ((INSTANCE) == UART7_S)  || ((INSTANCE) == UART7_NS) || \
                                    ((INSTANCE) == UART8_S)  || ((INSTANCE) == UART8_NS) || \
                                    ((INSTANCE) == UART9_S)  || ((INSTANCE) == UART9_NS))

/******************************* LPUART Instance ******************************/
#define IS_LPUART_INSTANCE(INSTANCE) (((INSTANCE) == LPUART1_S) || ((INSTANCE) == LPUART1_NS))

/************************* UART Instances : FIFO mode *************************/
#define IS_UART_FIFO_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS) || \
                                         ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS) || \
                                         ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS) || \
                                         ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS) || \
                                         ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)  || \
                                         ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)  || \
                                         ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)  || \
                                         ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)  || \
                                         ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)  || \
                                         ((INSTANCE) == LPUART1_S) || ((INSTANCE) == LPUART1_NS))

/****************** UART Instances : Auto Baud Rate detection *****************/
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S) || ((INSTANCE) == USART1_NS) || \
                                                            ((INSTANCE) == USART2_S) || ((INSTANCE) == USART2_NS) || \
                                                            ((INSTANCE) == USART3_S) || ((INSTANCE) == USART3_NS) || \
                                                            ((INSTANCE) == USART6_S) || ((INSTANCE) == USART6_NS) || \
                                                            ((INSTANCE) == UART4_S)  || ((INSTANCE) == UART4_NS)  || \
                                                            ((INSTANCE) == UART5_S)  || ((INSTANCE) == UART5_NS)  || \
                                                            ((INSTANCE) == UART7_S)  || ((INSTANCE) == UART7_NS)  || \
                                                            ((INSTANCE) == UART8_S)  || ((INSTANCE) == UART8_NS)  || \
                                                            ((INSTANCE) == UART9_S)  || ((INSTANCE) == UART9_NS))

/*********************** UART Instances : Driver Enable ***********************/
#define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS) || \
                                                  ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS) || \
                                                  ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS) || \
                                                  ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS) || \
                                                  ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)  || \
                                                  ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)  || \
                                                  ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)  || \
                                                  ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)  || \
                                                  ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)  || \
                                                  ((INSTANCE) == LPUART1_S) || ((INSTANCE) == LPUART1_NS))

/********************* UART Instances : Half-Duplex mode **********************/
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS) || \
                                               ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS) || \
                                               ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS) || \
                                               ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS) || \
                                               ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)  || \
                                               ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)  || \
                                               ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)  || \
                                               ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)  || \
                                               ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)  || \
                                               ((INSTANCE) == LPUART1_S) || ((INSTANCE) == LPUART1_NS))

/******************* UART Instances : Hardware Flow control *******************/
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS) || \
                                           ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS) || \
                                           ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS) || \
                                           ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS) || \
                                           ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)  || \
                                           ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)  || \
                                           ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)  || \
                                           ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)  || \
                                           ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)  || \
                                           ((INSTANCE) == LPUART1_S) || ((INSTANCE) == LPUART1_NS))

/************************* UART Instances : SPI Slave mode **************************/
#define IS_UART_SPI_SLAVE_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S) || ((INSTANCE) == USART1_NS) || \
                                              ((INSTANCE) == USART2_S) || ((INSTANCE) == USART2_NS) || \
                                              ((INSTANCE) == USART3_S) || ((INSTANCE) == USART3_NS) || \
                                              ((INSTANCE) == USART6_S) || ((INSTANCE) == USART6_NS))

/************************* UART Instances : LIN mode **************************/
#define IS_UART_LIN_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S) || ((INSTANCE) == USART1_NS) || \
                                        ((INSTANCE) == USART2_S) || ((INSTANCE) == USART2_NS) || \
                                        ((INSTANCE) == USART3_S) || ((INSTANCE) == USART3_NS) || \
                                        ((INSTANCE) == USART6_S) || ((INSTANCE) == USART6_NS) || \
                                        ((INSTANCE) == UART4_S)  || ((INSTANCE) == UART4_NS)  || \
                                        ((INSTANCE) == UART5_S)  || ((INSTANCE) == UART5_NS)  || \
                                        ((INSTANCE) == UART7_S)  || ((INSTANCE) == UART7_NS)  || \
                                        ((INSTANCE) == UART8_S)  || ((INSTANCE) == UART8_NS)  || \
                                        ((INSTANCE) == UART9_S)  || ((INSTANCE) == UART9_NS))

/****************** UART Instances : Wake-up from Stop mode *******************/
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS) || \
                                                    ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS) || \
                                                    ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS) || \
                                                    ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS) || \
                                                    ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)  || \
                                                    ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)  || \
                                                    ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)  || \
                                                    ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)  || \
                                                    ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)  || \
                                                    ((INSTANCE) == LPUART1_S) || ((INSTANCE) == LPUART1_NS))

/************************* UART Instances : IRDA mode *************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S) || ((INSTANCE) == USART1_NS) || \
                                    ((INSTANCE) == USART2_S) || ((INSTANCE) == USART2_NS) || \
                                    ((INSTANCE) == USART3_S) || ((INSTANCE) == USART3_NS) || \
                                    ((INSTANCE) == USART6_S) || ((INSTANCE) == USART6_NS) || \
                                    ((INSTANCE) == UART4_S)  || ((INSTANCE) == UART4_NS)  || \
                                    ((INSTANCE) == UART5_S)  || ((INSTANCE) == UART5_NS)  || \
                                    ((INSTANCE) == UART7_S)  || ((INSTANCE) == UART7_NS)  || \
                                    ((INSTANCE) == UART8_S)  || ((INSTANCE) == UART8_NS)  || \
                                    ((INSTANCE) == UART9_S)  || ((INSTANCE) == UART9_NS))

/********************* USART Instances : Smard card mode **********************/
#define IS_SMARTCARD_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S) || ((INSTANCE) == USART1_NS) || \
                                         ((INSTANCE) == USART2_S) || ((INSTANCE) == USART2_NS) || \
                                         ((INSTANCE) == USART3_S) || ((INSTANCE) == USART3_NS) || \
                                         ((INSTANCE) == USART6_S) || ((INSTANCE) == USART6_NS))

/****************************** UCPD Instances ********************************/
#define IS_UCPD_ALL_INSTANCE(INSTANCE)  (((INSTANCE) == UCPD1_S) || ((INSTANCE) == UCPD1_NS))

/******************************* USB_PCD Instances *******************************/
#define IS_PCD_ALL_INSTANCE(INSTANCE) (((INSTANCE) == USB3_S) || ((INSTANCE) == USB3_NS))

